#include <iostream>
#include "Subject.h"
#include "Student.h"
using namespace std;

/*
Написать программу «Группа студентов».
Программа получает следующие данные:
список студентов группы,
список предметов для группы,
таблицу оценок студентов группы по всем предметам.

Программа выводит следующие данные:
таблицу оценок студентов по предметам,
средние оценки студентов,
средние оценки по предметам,
средний балл группы,
максимальные и минимальные оценки по предметам 
с указанием студентов.

Разработать и использовать в программе классы:
«Группа», «Студент», «Предмет».

Атрибуты группы: название, список студентов, 
список предметов.
Атрибуты студента: имя, 
список оценок студента по конкретному предмету.
Атрибуты предмета: название.


*/


int main()
{
	//Subject subject1("Math");
	//subject1.Print();
	//int marks1[] = { 5,4,3,5,4 };
	//Student student1("Ivan", marks1, 5);

	return 0;
}